Revit 2027 API
LayeredNdfType Enumeration
 The enumerated type representing the permitted values for the asset property "LayeredNdfType" from the "AdvancedLayered" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LayeredNdfType
Public Enumeration LayeredNdfType
public enum class LayeredNdfType
type LayeredNdfType
Members
Member name | Value | Description
Beckmann | 0
Ggx | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace